module Cleverage.Client.Игра
open Types

let шоу = "MintCream Session"
let я = "👨🏿‍🦰"

let игроки = [
    "👨‍👦‍👦", "Буратино"
    "👣", "Маркиза"
    "😎", "Шайтан"
    "👨🏿‍🦰", "Карабас"
    "🍑", "Забава"
    "🦍", "Властелин"
    "🤖", "Самец"
    "🍆", "Утюг"
    "🌈", "Ведьма"
    "🎃", "Аватар"
]

let события = [
    // 🆔 Буратино узнал свою Роль...
    // 🆔 Забава узнала свою Роль...
    // 🆔 алюминиевый огурец узнал свою Роль...
    // 🆔 Свёкла узнала свою Роль...
    // 🆔 AdSKiYDRo4yLa узнал свою Роль...
    // 🆔 Гуамоколатокинт узнал свою Роль...
    // я не шептался
    // шайтан не шептался
    // аватар не шептался
    "🤖", ГолосуетПротив "👣"
    "😎", ГолосуетПротив "🌈"
    "👣", ГолосуетПротив "🍆"
    "🦍", ГолосуетПротив "🍆"
    "🍑", ГолосуетПротив "🤖"
    "👨🏿‍🦰", ГолосуетПротив "👨‍👦‍👦"
    "👨‍👦‍👦", ГолосуетПротив "👨🏿‍🦰"
    "🌈", ГолосуетПротив "🎃"
    "🍆", ГолосуетПротив "🤖"
]
