module Cleverage.Client.Игра
open Types

let шоу = "PowderBlue Favour"
let я = "👨🏿‍🦰"

let игроки = [
    "🤡", "Фаворит"
    "👨🏿‍🦰", "Карабас"
    "👽", "Мутант"
    "🕺🏻", "Утюг"
    "👣", "Маркиза"
    "👨‍👦‍👦", "Буратино"
    "♟", "Жмых"
    "🍌", "Командор"
    "🌈", "Аврора"
    "🦦", "Чертовка"
]

let события = [
    "♟", ПолучилКлючНе (Спаситель, "🕺🏻")
    "👨🏿‍🦰", ГолосуетПротив "👽"
    "♟", ГолосуетПротив "🍌"
    "👣", ГолосуетПротив "👨🏿‍🦰"
    "🕺🏻", ГолосуетПротив "🍌"
    "🍌", ГолосуетПротив "👨‍👦‍👦"
    "🌈", ГолосуетПротив "♟"
    "🦦", ГолосуетПротив "👨🏿‍🦰"
    "👨‍👦‍👦", ГолосуетПротив "👣"
    "🤡", ГолосуетПротив "♟"
    "👽", ГолосуетПротив "🍌"
    "", ПовторноеГолосование
    "🍌", ГолосуетПротив "♟"
    "👽", ГолосуетПротив "🍌"
    "🤡", ПолучилКлючНе (Демон, "🍌")
    "♟", ГолосуетПротив "🍌"
    "🕺🏻", ГолосуетПротив "♟"
    "🕺🏻", Подозрительно "🍌 -> ♟"
    "👣", ГолосуетПротив "👨🏿‍🦰"
    "🌈", ГолосуетПротив "♟"
    "👨‍👦‍👦", ГолосуетПротив "♟"
    "👨🏿‍🦰", ГолосуетПротив "♟"
    "🤡", ГолосуетПротив "♟"
    "🤡", Подозрительно "🍌 -> ♟"
    "🦦", ГолосуетПротив "♟"
    "🦦", Подозрительно "👨🏿‍🦰 -> ♟"
    "♟", ПорабощёнНе Демон
    "", Ночь
    "🍌", ПорабощёнНе Демон
    "", День
    "👽", ПолучилКлючНе (Спаситель, "👨🏿‍🦰")
    "🤡", Подозрительно "соврал что ТЗ узнавал на того у кого больше было голосов, хотя было по 1"
    "👽", ГолосуетПротив "👨‍👦‍👦"
    "👨‍👦‍👦", ГолосуетПротив "🦦"
    "👣", ГолосуетПротив "👨🏿‍🦰"
    "🕺🏻", ГолосуетПротив "🦦"
    "🦦", ГолосуетПротив "👨‍👦‍👦"
    "🤡", ГолосуетПротив "👣"
    "🌈", ГолосуетПротив "🕺🏻"
    "👨🏿‍🦰", ГолосуетПротив "👣"
    "👨‍👦‍👦", ПорабощёнНе Спаситель
    "", Ночь
    "🌈", ПорабощёнНе Масон
    "🌈", ПорабощёнНе Рептилоид
    "👨‍👦‍👦", ПорабощёнНе Рептилоид
    "", День
    "👣", ПолучилКлючНе (Демон, "👨🏿‍🦰")
]
