module Cleverage.Client.Игра
open Types

let шоу = "🍒 Шоу: Black Influence"
let я = "🧉"

let игроки = [
    "👣", "Маркиза"
    "⚜️", "Жмых"
    "🧉", "Карабас"
    "🎃", "Аватар"
    "🍑", "Забава"
    "🍌", "Командор"
    "🥳", "Аврора"
    "🌈", "Изюминка"
    "🖕🏿", "Буратино"
    "Г", "Гармония"
]

let события = [
    "🍌", Подозрительно "не знает кто ночью"
    "Г", Подозрительно "новенькая"
    "🖕🏿", Подозрительно "хихикнул когда желал хорошей игры"
    "🍑", Подозрительно "просит не упоминать в пророчествах"
    "🧉", Пророчит ("🌈", "⚜️", "🍑", "🥳")
    "", День
    "⚜️", ГолосуетПротив "🍑"
    "🧉", ГолосуетПротив "🥳"
    "🍑", ГолосуетПротив "🎃"
    "🖕🏿", ГолосуетПротив "🌈"
    "Г", ГолосуетПротив "🎃"
    "🍌", ГолосуетПротив "🎃"
    "🌈", ГолосуетПротив "⚜️"
    "👣", ГолосуетПротив "🎃"
    "🎃", ГолосуетПротив "🖕🏿"
    "🥳", ГолосуетПротив "👣"
    "", ПовторноеГолосование
    "⚜️", Щадит "🎃"
    "Г", ГолосуетПротив "🎃"
    "🥳", Щадит "🎃"
    "🖕🏿", Щадит "🎃"
    "🍑", ГолосуетПротив "🎃"
    "👣", ГолосуетПротив "🎃"
    "🌈", Щадит "🎃"
    "🧉", ГолосуетПротив "🎃"
    "🍌", ГолосуетПротив "🎃"
    "🎃", ПорабощёнНе Демон
    "", Ночь
    "🧉", ГолосуетПротив "🎃"
    "🖕🏿", ГолосуетПротив "⚜️"
    "🥳", ПопалВРабствоКиНе [ Демон ]
    "🍑", ПопалВРабствоКиНе [ Рептилоид; Демон ]
    "", День
    "🧉", ПолучилКлючНе (Спаситель, "🖕🏿")
    "⚜️", ГолосуетПротив "🌈"
    "🧉", ГолосуетПротив "⚜️"
    "🍌", ГолосуетПротив "🌈"
    "👣", ГолосуетПротив "⚜️"
    "🖕🏿", ГолосуетПротив "🌈"
    "🌈", ГолосуетПротив "🧉"
    "", ПовторноеГолосование
    "🖕🏿", ГолосуетПротив "🌈"
    "🌈", ПорабощёнНе Демон
    "", Ночь
    "👣", ПопалВРабствоКиНе [ Демон ]
    "🌈", ИзНегоВыбилиНе Рептилоид
    "", День
    "🧉", ГолосуетПротив "⚜️"
    "⚜️", ГолосуетПротив "🧉"
    "Г", ГолосуетПротив "⚜️"
    "🖕🏿", ГолосуетПротив "Г"
    "", Ночь
    "Г", ПолучилКлючНе (Демон, "🍌")

]
