module Cleverage.Client.Игра
open Types

let шоу = "🍒 Шоу: 🔲 HotPink Range (с Привилегиями)"
// let я = "👰🏻‍♂️"
// let я = "🚷"
let я = "💀"

let игроки = [
    "🥑", "Авокадо"
    "✍️", "Минздрав"
    "👨🏻‍🎨", "Сальвадор"
    "👣", "Маркиза"
    "♟", "Жмых"
    "🐣", "Мальвина"
    "💀", "Карабас"
    "🎎", "Буратино"
    "🦈", "Хиппи"
    "🦩", "Киборг"
]

let события = [
    "💀", Оказался Спаситель
    "", День 1
    "✍️", ПолучилКлючНе (Демон, "🎎")
    "✍️", ГолосуетПротив "🥑"
    "♟", ГолосуетПротив "👣"
    "🦈", ГолосуетПротив "🐣"
    "💀", ГолосуетПротив "🥑"
    "🦩", ГолосуетПротив "🥑"
    "👣", ГолосуетПротив "💀"
    "🥑", ГолосуетПротив "♟"
    "👨🏻‍🎨", ГолосуетПротив "🐣"
    "🎎", ГолосуетПротив "👨🏻‍🎨"
]
